// 1.Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.

let i = 1;
while (i <= 10) {
  console.log(i);
  i += 1;
}

// 2.Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.

for (let index = 0; index <= 20; index += 1) {
   if (index % 2 === 0) {
    console.log(index);
    }
}

// 3.Вивести в консоль таблицю множення числа 7 за допомогою циклу for.

for (let i = 1; i <= 9; i += 1) {
  console.log(`Таблиця множення числа ${7} x ${i} = ${7 * i}`);
}

// 4.Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.

let i;
for (let i = 0; i < 45; i +=1) {
    if (i >= 44) {
        break;
    }
    console.log(i);
    
}

// 5.За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.

let index = 1;
 while (index <= 20) {
    if (index % 3 === 0) {
        continue
     }
     console.log(index);
     index += 1;
 }
    